// برای اینپورت کردن یه پکیج یا اضافه کردن یه ماژول به برنامه
// const uuid = require('uuid')
// console.log(uuid.v4())

// تغییر ورژن برنامه 
// npm version patch (x.x.A) فقط باگ هارو رفع کردی
// npm version minor (x.A.x) فیچرهایی اضافه کردی و ای پی ای تغییر نکردن
// npm version major (A.x.x) فیچرهایی اضافه کردی و ای پی ای تغییر کردن

// یرای دانلود پکیح هایی که بعدا برای پابلیش کردن اپ بهشون نیاز نداریم
// npm i اسم پکیج --save-dev

// حذف کردن پکیج
// npm un اسم پکیج

// دانلود نسخه دیگری از پکیج
// npm i اسم پکیج@شماره نسخه
// مثال: npm i jshint@2.10.1

// فهمیدن اینکه کدم پکیج‌ها ورژنشون قدیمیه میشه اپ‌دیت کرد
// npm outdated

// ادپدیت کردن ورژن پکیج (تمام پکیج ها یکجا)
// npm update